[LANG]
language=Thai (ประเทศไทย)
[FONT]
font-name=Leelawadee UI
welcome-text-size=64
home-text-size=24
home-section-size=26
analysis-text-size=22
analysis-section-size=24
left-panel-size=18
panel-list-size=18
panel-list-label-size=22
panel-list-header-size=18
panel-list-item-size=15
panel-button-size=14
combobox-size=18
list-combobox-size=18
checkbox-size=16
radio-size=17
elem-size=12
image-button-size=16
form-text-size=17
list-text-size=18
search-edit-size=18
message-text-size=18
setting-button-size=14
process-text-size=16
properites-title-font=20
properites-section-font=18
log-list-item-text-size=14
log-list-item-sql-size=16
[ERROR]
000000=
200001=ข้อผิดพลาดไวยากรณ์ SQL
200002=ไม่พบไฟล์
200003=ไฟล์เสียหาย
200004=ข้อผิดพลาดพารามิเตอร์
200026=ชื่อตารางซ้ำกัน
200027=ไม่พบชื่อตาราง
200028=ข้อผิดพลาดในการนำเข้าไฟล์ CSV ไม่สามารถสร้าง SQL ได้ โปรดตรวจสอบเนื้อหาไฟล์ CSV และรายการตั้งค่าว่าถูกต้องหรือไม่
300001=ยังไม่ได้เลือกคอลัมน์ตารางเพื่อสร้างดัชนี
300002=คำสั่ง SQL ไม่สามารถว่างเปล่าได้
300003=การวิเคราะห์ SQL รองรับเฉพาะคำสั่งคิวรี SELECT
[STRING]
home=หน้าหลัก
database=ฐานข้อมูล
analysis=การวิเคราะห์
view=วิว
setting=การตั้งค่า
items=ระเบียน
tables=ตาราง
views=วิว
triggers=ทริกเกอร์
columns=คอลัมน์
indexes=ดัชนี
table=ตาราง
clear-all=ล้างทั้งหมด
yes=ใช่
no=ไม่
welcome-text=ยินดีต้อนรับสู่ CuteSqlite
home-text1=CuteSqlite เป็นเครื่องมือไคลเอนต์ส่วนติดต่อผู้ใช้กราฟิก (GUI) สำหรับ Sqlite3
home-text2=ช่วยให้คุณสามารถออกแบบ สร้าง และเรียกดูฐานข้อมูล จัดการวัตถุฐานข้อมูล
home-text3=และแทรกข้อมูล ตลอดจนออกแบบและรันคิวรี SQL เพื่อประมวลผลข้อมูลที่จัดเก็บ
home-text4=คุณยังสามารถย้ายฐานข้อมูลและข้อมูลจากผู้ให้บริการฐานข้อมูลอื่นไปยังฐานข้อมูล Sqlite
db-section-text=ฐานข้อมูล Sqlite
analysis-text1=CuteSqlite ช่วยให้คุณวิเคราะห์และปรับประสิทธิภาพการทำงานของคำสั่ง SQL
analysis-text2=และช่วยให้คุณวิเคราะห์ความจุการจัดเก็บของ每张ตารางในฐานข้อมูล
analysis-text3=รวมถึงกำหนดค่าพารามิเตอร์ของฐานข้อมูลเพื่อปรับประสิทธิภาพฐานข้อมูล
perf-analysis-section-text=การวิเคราะห์ประสิทธิภาพ
error-text=ข้อผิดพลาดของระบบ:
create-database=สร้างฐานข้อมูลใหม่ (Ctrl+N)
open-database=เปิดฐานข้อมูล (Ctrl+O)
refresh-database=รีเฟรชฐานข้อมูล (F5)
delete-database=ลบฐานข้อมูลที่เลือกออกจากรายการ (Del)
override-user-db=ข้อมูลของไฟล์จะไม่สามารถกู้คืนได้หลังจากลบ คุณแน่ใจหรือไม่ที่จะเขียนทับฐานข้อมูล?
create-db-success-text=สร้างฐานข้อมูลสำเร็จ
open-db-exists-inlist=ฐานข้อมูลเปิดอยู่แล้ว โปรดอย่าดำเนินการซ้ำ
open-db-success-text=เปิดฐานข้อมูลสำเร็จ
delete-user-db=คุณแน่ใจหรือไม่ที่จะลบฐานข้อมูล "{dbName}" ที่เลือกออกจากรายการ?
delete-db-success-text=ลบฐานข้อมูลออกจากรายการสำเร็จ
query-editor=ตัวแก้ไขคิวรี
history=ประวัติ
history-tip=ประวัติ (F8)
result-list=ผลลัพธ์
result-info=ข้อมูล
result-table-data=ข้อมูลตาราง
table-properties=คุณสมบัติตาราง
exec-select-sql=รันคิวรีที่เลือกปัจจุบัน (F9)
exec-all-sql=รันคิวรีทั้งหมด (F10)
explain-select-sql=Explain คำสั่ง SQL ที่เลือกปัจจุบัน (F11)
explain-query-plan-sql=Explain query plan คำสั่ง SQL ที่เลือกปัจจุบัน (F12)
query-page-help=ฟีเจอร์เติมอัตโนมัติ: [Tab]->แท็บถัดไป; [Ctrl+Space]->แสดงรายการแท็บที่ตรงกัน; [Ctrl+Enter]->แสดงรายการแท็บทั้งหมด
no-select-userdb=ยังไม่ได้เลือกฐานข้อมูล
no-sql-statement=ไม่ได้ป้อนคำสั่ง SQL ในตัวแก้ไขคิวรี
no-sql-content=ไม่มีคำสั่ง SQL ในตัวแก้ไขคิวรี
show-form-view=แสดงมุมมองแบบฟอร์ม
export-result-as=ส่งออกเป็น... (Ctrl+Alt+E)
copy-result-data=คัดลอกข้อมูลไปยังคลิปบอร์ด
clear-all=ล้างทั้งหมด
ok=ตกลง
cancel=ยกเลิก
export-text-description=เลือกรูปแบบการส่งออกข้อมูล
csv-settings=ตัวเลือก csv
csv-field-settings=คอลัมน์
csv-line-settings=แถว
csv-charset-settings=การเข้ารหัส
excel-settings=ตัวเลือก Excel
sql-settings=ตัวเลือก SQL
export-fields-settings=เลือกคอลัมน์ที่จะส่งออก
terminated-by=ตัวคั่น
enclosed-by=ตัวล้อม
escaped-by=ตัวหลุด
field-terminated-by=ตัวคั่นคอลัมน์
field-enclosed-by=ตัวล้อมคอลัมน์
field-escaped-by=ตัวหลุดคอลัมน์
line-terminated-by=ตัวขึ้นบรรทัดใหม่
add-column-name=เพิ่มชื่อคอลัมน์ในส่วนหัว
csv-charset=การเข้ารหัส
excel-column-max-size=จำกัดขนาดคอลัมน์ข้อความ
excel-decinmal-places=ตำแหน่งทศนิยม
structure-only=เฉพาะโครงสร้างตาราง
data-only=เฉพาะข้อมูล
structure-and-data=โครงสร้างตารางและข้อมูล
select-all=เลือกทั้งหมด
deselect-all=ยกเลิกเลือกทั้งหมด
save-to-file=ส่งออกเป็นไฟล์
expert-fmt-error=โปรดเลือกรูปแบบไฟล์ส่งออกข้อมูล
terminated-by-error=โปรดป้อนค่า "สิ้นสุดด้วย"
enclosed-by-error=โปรดป้อนค่า "ล้อมด้วย"
escaped-by-error=โปรดป้อนค่า "ตัวหลุด"
line-terminated-by-error=ค่า "สิ้นสุดด้วย" ของแถวไม่ถูกต้อง
excel-column-max-size-error=โปรดป้อนค่า "จำกัดขนาดคอลัมน์ข้อความ"
excel-decinmal-places-error=โปรดป้อนค่า "ตำแหน่งทศนิยม"
export-sql-error=โปรดเลือกตัวเลือก SQL
selected-fields-error=โปรดเลือกคอลัมน์ที่จะส่งออก
export-path-error=โปรดป้อนเส้นทางไฟล์ส่งออก
sql-notsupport-multitable-query-error=ไม่รองรับการส่งออกผลลัพธ์คิวรีหลายตารางและคิวรีรอง
export-success-text=ส่งออกสำเร็จ ส่งออกข้อมูลแล้ว {rows} แถว ต้องการเปิดไฟล์หรือไม่?
open-the-file=เปิดไฟล์
export-file-exists-prompt={export-path} มีอยู่แล้ว ต้องการแทนที่หรือไม่?
limit-rows=จำกัดแถว
offset=แถวเริ่มต้น
rows=จำนวนแถว
copy-all-rows-to-clipboard=คัดลอกแถวทั้งหมดไปยังคลิปบอร์ด	Ctrl+Alt+A
copy-sel-rows-to-clipboard=คัดลอกแถวที่เลือกไปยังคลิปบอร์ด	Ctrl+Alt+H
copy-all-rows-as-sql=คัดลอกแถวทั้งหมดเป็น SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=คัดลอกแถวที่เลือกเป็น SQL	Ctrl+Alt+K
read-only=อ่านอย่างเดียว
filter=ตัวกรอง (Ctrl+Alt+F)
filter-in-use=กำลังใช้ตัวกรอง
refresh=รีเฟรช (Ctrl+F5)
refresh-page=รีเฟรช
new-row-tip=สร้างแถวใหม่ (Ctrl+Alt+N)
copy-row-tip=คัดลอกหนึ่งแถว (Ctrl+Alt+C)
save-tip=บันทึก (Ctrl+Alt+S)
delete-tip=ลบแถวที่เลือก (Ctrl+Del)
cancel-tip=เลิกทำเปลี่ยนแปลง (Ctrl+Alt+Z)
revert-tip=คืนค่า
save=บันทึก
revert=เลิกทำเปลี่ยนแปลง
column=ชื่อคอลัมน์
condition=เงื่อนไข
value=ค่า
delete-confirm-text=คุณแน่ใจหรือไม่ที่จะลบแถวที่เลือก?
query=คิวรี
result=ผลลัพธ์
affected-rows=จำนวนแถวที่ได้รับผลกระทบ
exec-time=เวลาดำเนินการ
transfer-time=เวลาถ่ายโอน
total-time=เวลาทั้งหมด
database-create=สร้างฐานข้อมูลใหม่		Ctrl+N
database-open=เปิดฐานข้อมูล		Ctrl+O
database-refresh=รีเฟรชฐานข้อมูล		Ctrl+R
database-delete=ลบฐานข้อมูล		Del
database-copy=คัดลอกฐานข้อมูลเป็น...	Ctrl+P
database-export-as-sql=ส่งออกฐานข้อมูลเป็น SQL	Ctrl+E
database-import-from-sql=นำเข้า SQL ไปยังฐานข้อมูล	Ctrl+I
database-new=สร้าง
database-new-table=ตาราง
database-new-view=วิว
database-new-trigger=ทริกเกอร์
export-as-sql-text-description=ส่งออกตาราง/วิว/ทริกเกอร์ของฐานข้อมูลที่เลือกเป็น SQL
select-database=ฐานข้อมูลที่เลือก
database-objects=วัตถุ
structure-and-data-settings=การตั้งค่าโครงสร้างและข้อมูล
insert-statement-settings=การตั้งค่าคำสั่ง INSERT
tbl-statement-settings=การตั้งค่าคำสั่งตาราง
retain-column-text=รักษาชื่อคอลัมน์ใน "Insert Into"
contain-multi-rows-text=แต่ละคำสั่ง "Insert" มีหลายแถว (VALUES)
retain-table-text=รักษาตารางเก่า (Create Table If Not Exists ...)
override-table-text=เขียนทับตารางเก่า (DROP TABLE แล้ว CREATE TABLE)
import-from-sql-text-description=รันคำสั่งในไฟล์ SQL เป็นชุด
abort-on-error-text=หยุดเมื่อเกิดข้อผิดพลาด
import-file-not-exists=ไม่พบไฟล์ SQL ที่นำเข้า โปรดเลือกใหม่
import-path-empty-error=เส้นทางไฟล์ที่นำเข้าไม่สามารถว่างเปล่าได้
import=นำเข้า
export=ส่งออก
tbl-name=ชื่อตาราง
new-table=สร้างตาราง
new-view=สร้างวิว
new-trigger=สร้างทริกเกอร์
database=ฐานข้อมูล
schema=สคีมา
table-columns=คอลัมน์
table-indexes=ดัชนี
table-foreignkeys=คีย์ต่างประเทศ
column-name=ชื่อคอลัมน์
data-type=ประเภทข้อมูล
default=ค่าเริ่มต้น
check=ตรวจสอบ
index-name=ชื่อดัชนี
index-type=ประเภทดัชนี
index-unique=Unique
partial-clause=ประโยคย่อยบางส่วน
comments=ความคิดเห็น
to-be-selected=คอลัมน์รอเลือก
selected=คอลัมน์ที่เลือกแล้ว
up=▲
down=▼
no-columns-selected=ยังไม่ได้เลือกคอลัมน์ โปรดเลือก
sql-preview=ดูตัวอย่าง SQL
tbl-name-empty=ชื่อตารางไม่สามารถว่างเปล่าได้
tbl-name-duplicated=ชื่อตารางซ้ำกัน
create-table-success-text=สร้างตารางสำเร็จ
alter-table-success-text=แก้ไขตารางสำเร็จ
rename-table-success-text=เปลี่ยนชื่อตารางสำเร็จ
delete-column-confirm-text=คอลัมน์ที่เลือกถูกอ้างอิงโดยหนึ่งหรือหลายดัชนี การลบคอลัมน์นี้จะแก้ไขดัชนีที่เกี่ยวข้องด้วย คุณแน่ใจหรือไม่ที่จะดำเนินการลบต่อ?
delete-index-confirm-text=ดัชนีที่เลือกถูกอ้างอิงโดยหนึ่งหรือหลายคอลัมน์ การลบดัชนีนี้จะแก้ไขคอลัมน์ที่เกี่ยวข้องด้วย คุณแน่ใจหรือไม่ที่จะดำเนินการลบต่อ?
delete-confirm-text=คุณแน่ใจหรือไม่ที่จะดำเนินการลบต่อ?
new-view=สร้างวิว
new-trigger=สร้างทริกเกอร์
create-a-view-name=ชื่อวิวใหม่
view-name-not-empty=ชื่อวิวใหม่ไม่สามารถว่างเปล่าได้
view-name-duplicated=ชื่อวิวซ้ำกัน
create-a-trigger-name=ชื่อทริกเกอร์
trigger-name-not-empty=ชื่อทริกเกอร์ไม่สามารถว่างเปล่าได้
trigger-name-duplicated=ชื่อทริกเกอร์ซ้ำกัน
execute-sql-success=รัน SQL สำเร็จ
copy-db-success-text=คัดลอกฐานข้อมูลสำเร็จ
table-open=เปิดข้อมูลตาราง		Alt+O
table-create=สร้างตาราง		Alt+N
table-alter=แก้ไขตาราง		Alt+A
table-rename=เปลี่ยนชื่อตาราง		Alt+M
table-truncate=ล้างตาราง		Alt+T
table-drop=ลบตาราง		Alt+Del
table-copy-as=คัดลอกตารางเป็น...		Alt+P
table-sharding-as=แบ่งส่วน		Alt+G
table-export=ส่งออกตารางเป็น...	Alt+E
table-import-sql=นำเข้าจากไฟล์ SQL	Alt+I
table-import-csv=นำเข้าจากไฟล์ CSV	Alt+J
table-manage-index=จัดการดัชนีตาราง
table-manage-foreign-key=จัดการคีย์ต่างประเทศตาราง
properties=คุณสมบัติ
primary-key-duplicated=คีย์หลัก (Primary key) นิยามซ้ำกัน
foreignkey-name=ชื่อคีย์ต่างประเทศ
referencing-columns=คอลัมน์ตารางนี้
referenced-table=ตารางที่อ้างอิง
referenced-columns=คอลัมน์ที่อ้างอิง
on-update=On Update
on-delete=On Delete
insert-new-column=เพิ่มคอลัมน์ใหม่
insert-new-index=เพิ่มดัชนีใหม่
insert-new-foreignkey=เพิ่มคีย์ต่างประเทศใหม่
insert-del-column=ลบคอลัมน์ที่เลือก
insert-del-index=ลบดัชนีที่เลือก
insert-del-foreignkey=ลบคีย์ต่างประเทศที่เลือก
select-referenced-table-first=โปรดเลือกตารางที่อ้างอิงก่อน
new-table-name=ชื่อตารางใหม่
table-name-not-empty=ชื่อตารางใหม่ไม่สามารถว่างเปล่าได้
table-name-duplicated=ชื่อตารางใหม่ซ้ำกัน
ai-column-exists=คอลัมน์เพิ่มอัตโนมัติ (AUTOINCREMENT) มีอยู่แล้ว
ai-fobidden-multi-pk=มีคอลัมน์เพิ่มอัตโนมัติ (AUTOINCREMENT) แล้ว ไม่อนุญาตให้มีคอลัมน์คีย์หลักหลายคอลัมน์
ai-column-must-integer=คอลัมน์เพิ่มอัตโนมัติ (AUTOINCREMENT) ต้องเป็นประเภทจำนวนเต็ม INTEGER
truncate-table-confirm-text=หลังจากล้างตาราง ข้อมูลจะไม่สามารถกู้คืนได้ คุณแน่ใจหรือไม่ที่จะล้าง?
truncate-table-success-text=ล้างข้อมูลตารางสำเร็จ
drop-table-confirm-text=หลังจากลบตารางข้อมูล ข้อมูลจะไม่สามารถกู้คืนได้ คุณแน่ใจหรือไม่ที่จะลบ?
drop-table-success-text=ลบตารางข้อมูลสำเร็จ
copy-table-text-description=กำหนดค่าพารามิเตอร์การคัดลอก รองรับ การแบ่งส่วนตารางข้อมูล
from-db-name=ฐานข้อมูลต้นทาง
from-tbl-name=ตารางต้นทาง
to-db-name=ฐานข้อมูลปลายทาง
to-tbl-name=ตารางปลายทาง
table-sharding-setttings=การแบ่งส่วนตารางข้อมูล
enable-table-sharding=เปิดใช้งานการแบ่งส่วนตารางข้อมูล
table-suffix-begin={suffix} จำนวนเริ่มต้น
table-suffix-end={suffix} จำนวนสิ้นสุด
advanced-settings=ตัวเลือกขั้นสูงการแบ่งส่วนตาราง
enable-copy-data-with-strategy=เปิดใช้งานกลยุทธ์ คัดลอกข้อมูลไปยังตารางแบ่งส่วน
sharding-strategy-express-text=นิพจน์กลยุทธ์การแบ่งตาราง: {n}
preview-sql=ดูตัวอย่างคำสั่ง SQL
structure-and-data-settings-unknown=ยังไม่ได้เลือกการตั้งค่าโครงสร้างและข้อมูล
table-suffix-error=จำนวนแบ่งส่วนไม่ถูกต้อง โปรดกรอกค่าที่ถูกต้อง
target-table-name-no-n=ตารางปลายทางต้องรวมสตริง "{n}"
sharding-strategy-express-empty=นิพจน์กลยุทธ์การแบ่งตารางไม่สามารถว่างเปล่าได้
copy-table-success-text=คัดลอกตารางสำเร็จ
start=เริ่ม
complete=เสร็จสิ้น
express-title=นิพจน์กลยุทธ์การแบ่งส่วนตาราง
functions=ฟังก์ชัน
express-editor-help=นิพจน์ - ดับเบิลคลิกฟังก์ชันหรือคอลัมน์ แทรกลงในตัวแก้ไข
import-from-csv-text-description=รายการตั้งค่าสำหรับการนำเข้าข้อมูลจากไฟล์ CSV
source-csv-file=เส้นทางไฟล์ CSV ต้นทาง
target-database=ฐานข้อมูลปลายทาง
target-table=ตารางปลายทาง
columns-setttings=คอลัมน์
csv-data=ข้อมูล CSV
column-name-on-top=ใช้แถวแรกเป็นชื่อคอลัมน์
line-terminated-by=ตัวขึ้นบรรทัดใหม่
csv-null-as-keyword=ใช้ null/NULL เป็นคำสำคัญ SQL
encoding=Encoding
import-success-text=นำเข้าสำเร็จ
incorrect-sql-statement=คำสั่ง SQL ไม่ถูกต้อง
import-error-text=ข้อผิดพลาดในการนำเข้า
table-manage-columns=จัดการคอลัมน์
table-drop-column=ลบคอลัมน์
table-manage-indexes=จัดการดัชนี
table-drop-index=ลบดัชนี
create-view=สร้างวิวใหม่
open-view=เปิดวิว
drop-view=ลบวิว
create-trigger=สร้างทริกเกอร์
open-trigger=เปิดทริกเกอร์
drop-trigger=ลบทริกเกอร์
drop-view-confirm-text=หลังจากลบวิว วิวจะไม่สามารถกู้คืนได้ คุณแน่ใจหรือไม่ที่จะลบ?
drop-view-success-text=ลบวิวสำเร็จ
drop-trigger-confirm-text=หลังจากลบทริกเกอร์ ทริกเกอร์จะไม่สามารถกู้คืนได้ คุณแน่ใจหรือไม่ที่จะลบ?
drop-trigger-success-text=ลบทริกเกอร์สำเร็จ
sql-templates=เทมเพลตคำสั่ง SQL
pragma-templates=Pragmas
sql-log=บันทึก SQL
clear-all=ล้างทั้งหมด
use=ใช้
explain=Explain
top=ปักหมุด
untop=เลิกปักหมุด
copy=คัดลอก
delete=ลบ
today=วันนี้
yestoday=เมื่อวาน
delete-sql-log-confirm-text=คุณแน่ใจหรือไม่ที่จะลบบันทึก SQL?
copy-to-clipboard=คัดลอกไปยังคลิปบอร์ดแล้ว
save-success-text=บันทึกสำเร็จ
delete-success-text=ลบสำเร็จ
data-has-changed=ข้อมูลเปลี่ยนแปลงแล้ว คุณแน่ใจหรือไม่ที่จะปิดหน้า?
not-save-and-close=ไม่บันทึก ปิด
cancel=ยกเลิกการปิด
table-export-as=ส่งออกข้อมูลตาราง	Alt+E
export-as-sql-success-text=ส่งออกสำเร็จ ต้องการเปิดไฟล์หรือไม่?
new-query=สร้างหน้าต่างคิวรีใหม่ (F7)
save-current=บันทึกปัจจุบัน (Ctrl+S)
save-all=บันทึกทั้งหมด (Ctrl+Shift+S)
first-page=หน้าแรก
prev-page=หน้าก่อน
next-page=หน้าถัดไป
last-page=หน้าสุดท้าย
save-if-data-has-changed=ข้อมูลเปลี่ยนแปลงแล้ว คุณแน่ใจหรือไม่ที่จะบันทึกก่อน?
unsort=ยกเลิกการเรียงลำดับ
tab-close-this=ปิด
tab-close-others=ปิดอื่น ๆ
tab-close-left=ปิดทั้งหมดทางซ้าย
tab-close-right=ปิดทั้งหมดทางขวา
perf-analysis=การวิเคราะห์ประสิทธิภาพ
perf-analysis-reports=รายงานการวิเคราะห์
store-analysis=การวิเคราะห์ที่เก็บข้อมูล
db-params=พารามิเตอร์ฐานข้อมูล
not-select-sql=รองรับเฉพาะคำสั่ง SELECT
open-sql-log=เปิดบันทึก SQL เพื่อวิเคราะห์ประสิทธิภาพ (Ctrl+L)
add-sql-analysis=ป้อนคำสั่ง SQL เพื่อวิเคราะห์ประสิทธิภาพ (Ctrl+I)
sql-log-not-found=ไม่พบบันทึก SQL โปรดตรวจสอบว่าถูกลบหรือไม่
original-sql=คำสั่ง SQL ต้นฉบับ
where-clause-analysis=การวิเคราะห์ประโยค WHERE
order-clause-analysis=การวิเคราะห์ประโยค ORDER
covering-index-analysis=การวิเคราะห์ดัชนีครอบคลุม
table-join-analysis=การวิเคราะห์ Joins
in-table=ตารางข้อมูล
where-use-column=คำสั่ง WHERE ใช้คอลัมน์
order-use-column=คำสั่ง ORDER ใช้คอลัมน์
covering-index-column=คำสั่ง WHERE และ ORDER ใช้คอลัมน์
where-use-index=คำสั่ง WHERE ใช้ดัชนี
order-use-index=คำสั่ง ORDER ใช้ดัชนี
use-covering-index=ใช้ดัชนีครอบคลุม
create-index-for-performance=คำแนะนำ: สร้างดัชนีสำหรับคอลัมน์ต่อไปนี้สามารถเพิ่มประสิทธิภาพคิวรี
hint-index-for-performance=คำแนะนำ: ดัชนี{hintIndexName} ครอบคลุมคอลัมน์ที่รวมอยู่: {hintIndexColumns}
create-covering-index-for-performance=คำแนะนำ: สร้างดัชนีครอบคลุมสำหรับคอลัมน์ต่อไปนี้สามารถเพิ่มประสิทธิภาพคิวรี
create-index-togeger=สร้างดัชนี
create-index-individ=สร้างดัชนีแยกกัน
create-covering-index=สร้างดัชนีครอบคลุม
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=รหัสเทียมด้านล่างแสดงกระบวนการดำเนินการของเครื่องมือปรับแต่งคิวรี
cycle-count=สถิติลูป
optimize-cycle-count=คำแนะนำ: เปลี่ยนลำดับตาราง JOIN ที่ต่างกันสามารถปรับ优化และลดจำนวนลูปได้
general-settings=การตั้งค่าทั่วไป
about=เกี่ยวกับ
language-setting=การตั้งค่าภาษาอินเทอร์เฟซ
change-language-restart-text=เปลี่ยนภาษา ต้องเริ่มใหม่ซอฟต์แวร์นี้จึงจะมีผล
close-and-restart=ปิดและเริ่มใหม่
do-not-restart=ไม่เริ่มใหม่
about-us=เกี่ยวกับเรา
about-us-description=CuteSqlite เป็นซอฟต์แวร์โอเพนซอร์สที่พัฒนาโดยผู้เขียน Xuehan Qin
version-info=เวอร์ชัน
version-info-description=CuteSqlite v0.2.2 beta (64 บิต)
feedback=คำติชม
feedback-description=หากคุณมีปัญหาเกี่ยวกับซอฟต์แวร์ หรือมีไอเดียและคำแนะนำสำหรับแอปพลิเคชันนี้ โปรดกรอกแบบฟอร์มด้านล่างเพื่อติชมเรา
content-text=เนื้อหา
license=Apache License Version 2.0
select-columns-analysis=การวิเคราะห์คอลัมน์ Select
select-use-column=คำสั่ง Select ใช้คอลัมน์ต่อไปนี้
select-use-column-count=จำนวนคอลัมน์
select-use-column-advice=คำแนะนำ: คอลัมน์ที่เลือกในคำสั่ง SELECT เกิน{maxColumns} คอลัมน์ พยายามลดคอลัมน์สามารถเพิ่มประสิทธิภาพคิวรี
select-use-column-tips=คำแนะนำ: พยายามลดคอลัมน์สามารถเพิ่มประสิทธิภาพคิวรี
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=การวิเคราะห์ที่เก็บข้อมูล:
analysis-sql=การวิเคราะห์ SQL
open-perf-report=เปิดรายงาน		Alt+O
drop-perf-report=ลบบันทึก		Alt+Del
drop-perf-report-confirm-text=คุณแน่ใจหรือไม่ที่จะลบบันทึก?
store-analysis-text=ช่วยให้คุณวิเคราะห์ความจุการจัดเก็บของฐานข้อมูล ตารางข้อมูล ดัชนีตาราง
table-store-analysis=ตาราง - {tblName}
index-store-analysis=ดัชนี - {idxName} - ตารางสังกัด:{tblName}
db-disk-used-title=รายงานอัตราการใช้พื้นที่ดิสก์ เส้นทาง DB:{dbPath}
page-size-text=ขนาดหน้า (หน่วย: ไบต์)
page-size-tips=ขนาดหน้า (หน่วย: ไบต์)
file-bytes-text=ขนาดไฟล์ (หน่วย: ไบต์)
file-bytes-tips=ขนาดไฟล์ (หน่วย: ไบต์)
file-pgcnt-text=จำนวนหน้าในไฟล์ทั้งหมด (ค่าที่วัด)
file-pgcnt-tips=จำนวนหน้าในไฟล์ทั้งหมด (ค่าที่วัด)
file-pgcnt2-text=จำนวนหน้าในไฟล์ทั้งหมด (ค่าที่คำนวณ)
file-pgcnt2-tips=จำนวนหน้าในไฟล์ทั้งหมด (ค่าที่คำนวณ)
inuse-pgcnt-text=จำนวนหน้าเก็บข้อมูล (ใช้แล้ว)
inuse-pgcnt-tips=จำนวนหน้าเก็บข้อมูล (ใช้แล้ว)
free-pgcnt2-text=จำนวนหน้าไม่เก็บข้อมูล (แต่ละส่วนหัว)
free-pgcnt2-tips=จำนวนหน้าไม่เก็บข้อมูล (แต่ละส่วนหัว)
free-pgcnt-text=จำนวนหน้าไม่เก็บข้อมูล (ค่าที่คำนวณ)
free-pgcnt-tips=จำนวนหน้าไม่เก็บข้อมูล (ค่าที่คำนวณ)
av-pgcnt-text=จำนวนหน้าที่ลบอัตโนมัติ
av-pgcnt-tips=จำนวนหน้าที่ลบอัตโนมัติ
ntable-text=จำนวนตารางในฐานข้อมูล
ntable-tips=จำนวนตารางในฐานข้อมูล
nindex-text=จำนวนดัชนี
nindex-tips=จำนวนดัชนี
nmanindex-text=จำนวนดัชนีที่นิยาม
nmanindex-tips=จำนวนดัชนีที่นิยาม
nautoindex-text=จำนวนดัชนีโดยนัย (ดัชนีเพิ่มอัตโนมัติ)
nautoindex-tips=จำนวนดัชนีโดยนัย (ดัชนีเพิ่มอัตโนมัติ)
user-payload-text=จำนวนไบต์เก็บ payload ที่มีประสิทธิภาพของผู้ใช้
user-payload-tips=จำนวนไบต์เก็บ payload ที่มีประสิทธิภาพของผู้ใช้
all-tbl-entrycnt-title=ปริมาณข้อมูลทั้งหมดของตาราง (จำนวน)
all-tbl-idx-pagecnt-title=จำนวนหน้าของตารางทั้งหมดและดัชนีของมัน
sperate-tbl-idx-pagecnt-title=คำนวณจำนวนหน้าของตารางทั้งหมดและดัชนีแยกกัน
all-tbl-idx-report-title=ตารางและดัชนีทั้งหมด
total-pages-percent-text=เปอร์เซ็นต์ของจำนวนฐานข้อมูลทั้งหมด
total-pages-percent-tips=เปอร์เซ็นต์ของจำนวนฐานข้อมูลทั้งหมด
nentry-text=ปริมาณข้อมูล (จำนวน)
nentry-tips=ปริมาณข้อมูล (จำนวน)
storage-text=จำนวนไบต์การจัดเก็บที่ใช้ไป
storage-tips=จำนวนไบต์การจัดเก็บที่ใช้ไป
compressed-size-text=จำนวนไบต์ที่ใช้หลังบีบอัด
compressed-size-tips=จำนวนไบต์ที่ใช้หลังบีบอัด
payload-text=จำนวนไบต์ของ payload
payload-tips=จำนวนไบต์ของ payload
total-meta-text=จำนวนไบต์ของเมตาดาต้า
total-meta-tips=จำนวนไบต์ของเมตาดาต้า
depth-text=ความลึกของต้นไม้ B
depth-tips=ความลึกของต้นไม้ B
avg-payload-text=payload ที่มีประสิทธิภาพเฉลี่ยต่อข้อมูล
avg-payload-tips=payload ที่มีประสิทธิภาพเฉลี่ยต่อข้อมูล
avg-unused-text=จำนวนไบต์ที่ไม่ได้ใช้เฉลี่ยต่อข้อมูล
avg-unused-tips=จำนวนไบต์ที่ไม่ได้ใช้เฉลี่ยต่อข้อมูล
avg-meta-text=เมตาดาต้าเฉลี่ยต่อข้อมูล
avg-meta-tips=เมตาดาต้าเฉลี่ยต่อข้อมูล
avg-fanout-text=จำนวน fanout เฉลี่ย
avg-fanout-tips=จำนวน fanout เฉลี่ย
gap-cnt-text=หน้าไม่ต่อเนื่อง
gap-cnt-tips=หน้าไม่ต่อเนื่อง
mx-payload-text=payload ที่มีประสิทธิภาพสูงสุดต่อข้อมูล
mx-payload-tips=payload ที่มีประสิทธิภาพสูงสุดต่อข้อมูล
ovfl-cnt-text=จำนวนข้อมูล overflow ที่ใช้
ovfl-cnt-tips=จำนวนข้อมูล overflow ที่ใช้
int-pages-text=จำนวนหน้าดัชนีที่ใช้
int-pages-tips=จำนวนหน้าดัชนีที่ใช้
leaf-pages-text=จำนวนหน้า leaf ที่ใช้
leaf-pages-tips=จำนวนหน้า leaf ที่ใช้
ovfl-pages-text=จำนวนหน้า overflow ที่ใช้
ovfl-pages-tips=จำนวนหน้า overflow ที่ใช้
total-pages-text=จำนวนหน้าทั้งหมดที่ใช้
total-pages-tips=จำนวนหน้าทั้งหมดที่ใช้
int-unused-text=จำนวนไบต์ที่ไม่ได้ใช้บนหน้าดัชนี
int-unused-tips=จำนวนไบต์ที่ไม่ได้ใช้บนหน้าดัชนี
leaf-unused-text=จำนวนไบต์ที่ไม่ได้ใช้บนหน้า leaf
leaf-unused-tips=จำนวนไบต์ที่ไม่ได้ใช้บนหน้า leaf
ovfl-unused-text=จำนวนไบต์ที่ไม่ได้ใช้บนหน้า overflow
ovfl-unused-tips=จำนวนไบต์ที่ไม่ได้ใช้บนหน้า overflow
total-unused-text=จำนวนไบต์ที่ไม่ได้ใช้บนหน้าทั้งหมด
total-unused-tips=จำนวนไบต์ที่ไม่ได้ใช้บนหน้าทั้งหมด
all-table-report-title=ตารางทั้งหมด (ไม่รวมดัชนี)
all-indices-report-title=ดัชนีทั้งหมด (ไม่รวมตาราง)
tbl-and-all-idx-report-title=ตาราง {tblName} และดัชนีทั้งหมดของมัน
tbl-only-report-title=ตาราง {tblName} ไม่รวมดัชนีใด ๆ
idx-only-report-title=ดัชนีทั้งหมดของตาราง {tblName}
tbl-report-title=ตาราง {tblName}
idx-report-title=ดัชนี {idxName} ของตาราง {tblName}
props-tbl-only-report-title=การวิเคราะห์ที่เก็บข้อมูลตาราง {tblName}
props-idx-props-only-report-title=ดัชนีทั้งหมดของตาราง {tblName}
db-pragma-params=พารามิเตอร์ PRAGMA
db-quick-config-params=แผนการกำหนดค่าด่วน
select-pragma=PRAGMA
pragma-analysis-limit-tips=คิวรีหรือเปลี่ยนขีดจำกัดของการตั้งค่าการวิเคราะห์โดยประมาณ (ANALYZE) นี่คือจำนวนแถวโดยประมาณที่คำสั่งวิเคราะห์ (ANALYZE) ตรวจสอบในแต่ละดัชนี
pragma-application-id-tips=ใช้สำหรับคิวรีหรือตั้งค่าจำนวนเต็ม "Applicatioin ID" 32 บิตมีเครื่องหมาย big-endian ที่ออฟเซ็ต 68 ไปยังส่วนหัวของฐานข้อมูล
pragma-auto-vacuum-tips=คิวรีหรือตั้งค่าสถานะ vacuum อัตโนมัติในฐานข้อมูล
pragma-automatic-index-tips=คิวรี ตั้งค่า หรือลบฟังก์ชันดัชนีอัตโนมัติ
pragma-busy-timeout-tips=คิวรีหรือเปลี่ยนการตั้งค่าเวลา超时忙碌 (busy timeout)
pragma-cache-size-tips=คิวรีหรือเปลี่ยนจำนวนหน้าดิสก์ฐานข้อมูลสูงสุดที่ SQLite แนะนำให้เก็บไว้ในหน่วยความจำสำหรับแต่ละไฟล์ฐานข้อมูลที่เปิด
pragma-cache-spill-tips=เปิดหรือปิดฟังก์ชันเพจเจอร์เพื่อระบายหน้าแคชสกปรกไปยังไฟล์ฐานข้อมูลกลางธุรกรรม
pragma-case-sensitive-like-tips=พฤติกรรมเริ่มต้นของตัวดำเนินการ LIKE คือละเว้นตัวพิมพ์ใหญ่เล็กของอักขระ ASCII ดังนั้นโดยค่าเริ่มต้น 'a' LIKE 'A' เป็น true
pragma-cell-size-check-tips=เปิดหรือปิดการตรวจสอบความสมบูรณ์อื่น ๆ เมื่ออ่านหน้าต้นไม้ B ของฐานข้อมูลจากดิสก์ครั้งแรก หลังเปิดการตรวจสอบขนาดเซลล์ ความเสียหายของฐานข้อมูลสามารถตรวจพบได้เร็วขึ้นและมีแนวโน้มที่จะ "แพร่กระจาย (Spread)" น้อยลง
pragma-checkpoint-fullfsync-tips=คิวรีหรือเปลี่ยนแฟล็ก fullfsync ของการดำเนินการ checkpoint หากตั้งค่าแฟล็กนี้ วิธีการซิงโครไนซ์ F_FULLFSYNC จะถูกใช้ระหว่างการดำเนินการ checkpoint บนระบบที่สนับสนุน F_FULLFSYNC ค่าเริ่มต้นของแฟล็ก CHECKPOINT_FULLFSYNC คือ OFF มีเพียง Mac OS-X เท่านั้นที่สนับสนุน F_FULLFSYNC
pragma-collation-list-tips=ส่งคืนรายการลำดับการเรียงลำดับที่กำหนดสำหรับการเชื่อมต่อฐานข้อมูลปัจจุบัน
pragma-compile-options-tips=ส่งคืนชื่อตัวเลือกเวลาคอมไพล์ที่ใช้เมื่อสร้าง SQLite หนึ่งตัวเลือกต่อหนึ่งบรรทัด
pragma-count-changes-tips=คิวรีหรือเปลี่ยนแฟล็ก count-changes โดยปกติเมื่อไม่ได้ตั้งค่าแฟล็ก count-changes คำสั่ง INSERT, UPDATE และ DELETE จะไม่ส่งคืนข้อมูล
pragma-data-store-directory-tips=คิวรีหรือเปลี่ยนค่าตัวแปร глобаль sqlite3_data_directory แบ็กเอนด์อินเทอร์เฟซระบบปฏิบัติการ Windows ใช้ตัวแปรนี้เพื่อระบุตำแหน่งเก็บไฟล์ฐานข้อมูลที่ระบุด้วยชื่อเส้นทางสัมพัทธ์
pragma-data-version-tips=ระบุว่าไฟล์ฐานข้อมูลถูกแก้ไขแล้ว โปรแกรมเชิงโต้ตอบที่เก็บเนื้อหาฐานข้อมูลในหน่วยความจำหรือแสดงเนื้อหาฐานข้อมูลบนหน้าจอสามารถใช้คำสั่ง PRADMA data_version เพื่อระบุว่าพวกมันจำเป็นต้องรีเฟรชและโหลดหน่วยความจำใหม่หรืออัปเดตการแสดงผลบนหน้าจอหรือไม่
pragma-default-cache-size-tips=คิวรีหรือตั้งค่าจำนวนหน้าแคشدิสก์สูงสุดที่แนะนำที่จะจัดสรรสำหรับแต่ละไฟล์ฐานข้อมูลที่เปิด
pragma-defer-foreign-keys-tips=ระบุว่าข้อจำกัดคีย์ต่างประเทศทั้งหมดถูกเลื่อนไปยังการ commit ธุรกรรมชั้นนอกสุด
pragma-empty-result-callbacks-tips=คิวรีหรือเปลี่ยนแฟล็ก callback ผลลัพธ์ว่าง
pragma-encoding-tips=การเข้ารหัสข้อความที่ใช้โดยฐานข้อมูลหลัก หนึ่งใน 'UTF-8', 'UTF-16le'(การเข้ารหัส UTF-16 little-endian) หรือ'UTF-16be'(การเข้ารหัส UTF-16 big-endian)
pragma-foreign-key-check-tips=ตรวจสอบว่าฐานข้อมูลหรือตารางมีการละเมิดข้อจำกัดคีย์ต่างประเทศหรือไม่
pragma-foreign-keys-tips=คิวรี ตั้งค่า หรือลบการบังคับใช้ข้อจำกัดคีย์ต่างประเทศ
pragma-freelist-count-tips=ส่งคืนจำนวนหน้าที่ไม่ได้ใช้ในไฟล์ฐานข้อมูล
pragma-full-column-names-tips=คิวรีหรือเปลี่ยนแฟล็ก full_column_names
pragma-fullfsync-tips=คิวรีหรือเปลี่ยนแฟล็ก fullfsync แฟล็กนี้ระบุว่าวิธีการนั้นจะถูกใช้บนระบบที่สนับสนุนวิธีการซิงโครไนซ์ F_FULLFSYNC หรือไม่ ค่าเริ่มต้นของแฟล็ก Fullfsync คือ OFF มีเพียง Mac OS X เท่านั้นที่สนับสนุน F_FULLFSYNC
pragma-hard-heap-limit-tips=กำหนดขีดจำกัดบนปริมาณหน่วยความจำ heap สำหรับการเชื่อมต่อฐานข้อมูลทั้งหมดในหนึ่งกระบวนการ
pragma-ignore-check-constraints-tips=เปิดหรือปิดการบังคับใช้ข้อจำกัด check การตั้งค่าเริ่มต้นคือ OFF ซึ่งหมายความว่าข้อจำกัด check ถูกบังคับใช้โดยค่าเริ่มต้น
pragma-incremental-vacuum-tips=ทำให้สูงสุด N หน้าถูกลบออกจากรายการฟรี
pragma-integrity-check-tips=ดำเนินการตรวจสอบรูปแบบและความสอดคล้องระดับต่ำบนฐานข้อมูล
pragma-journal-mode-tips=คิวรีหรือตั้งค่าโหมดบันทึกของฐานข้อมูลที่เชื่อมโยงกับการเชื่อมต่อฐานข้อมูลปัจจุบัน
pragma-journal-size-limit-tips=จำกัดขนาดของโลกรีโวลต์และไฟล์ WAL ที่เหลืออยู่ในระบบไฟล์หลังธุรกรรมหรือ checkpoint
pragma-legacy-alter-table-tips=ตั้งค่าหรือคิวรีค่าของแฟล็ก legacy_alter_table
pragma-locking-mode-tips=ตั้งค่าหรือคิวรีโหมดการล็อกการเชื่อมต่อฐานข้อมูล โหมดการล็อกคือโหมดปกติ (NORMAL) หรือโหมดเอกสิทธิ์ (EXCLUSIVE)
pragma-max-page-count-tips=คิวรีหรือตั้งค่าจำนวนหน้าสูงสุดในไฟล์ฐานข้อมูล
pragma-mmap-size-tips=คิวรีหรือเปลี่ยนจำนวนไบต์สูงสุดที่จองไว้สำหรับ I/O แบบ映射หน่วยความจำ (memory-mapped I/O) บนฐานข้อมูลเดียว
pragma-module-list-tips=ส่งคืนรายการโมดูลตารางเสมือนที่ลงทะเบียนกับการเชื่อมต่อฐานข้อมูล
pragma-optimize-tips=พยายามปรับประสิทธิภาพฐานข้อมูล
pragma-page-count-tips=ส่งคืนจำนวนหน้าทั้งหมดในไฟล์ฐานข้อมูล
pragma-page-size-tips=คิวรีหรือตั้งค่าขนาดหน้าของฐานข้อมูล ขนาดหน้าต้องเป็นกำลังของ 2 ระหว่าง 512% และ 65536
pragma-parser-trace-tips=เปิดการติดตาม parser SQL ที่ใช้ภายในโดย SQLite มีผลเมื่อคอมไพล์ด้วย SQLITE_DEBUG
pragma-query-only-tips=ป้องกันการเปลี่ยนแปลงข้อมูลบนไฟล์ฐานข้อมูล เมื่อเปิดใช้งานสิ่งนี้ ความพยายาม CREATE, REPORT, DROP, REPORT หรือ UPDATE ใด ๆ จะนำไปสู่ข้อผิดพลาด SQLITE_READONLY
pragma-quick-check-tips=ดำเนินการตั้งค่ารูปแบบและการตรวจสอบความสอดคล้องระดับต่ำบนฐานข้อมูล ข้ามการตรวจสอบความสอดคล้อง UNIQUE และดัชนี
pragma-read-uncommitted-tips=คิวรี ตั้งค่า หรือลบการแยก READ UNCOMMITTED
pragma-recursive-triggers-tips=คิวรี ตั้งค่า หรือลบฟังก์ชันเรียกซ้ำของทริกเกอร์
pragma-reverse-unordered-selects-tips=เมื่อเปิดใช้งาน PRAGMA นี้ทำให้คำสั่ง SELECT จำนวนมากที่ไม่มีประโยค ORDER BY ออกผลลัพธ์ในลำดับตรงกันข้ามกับปกติ
pragma-schema-version-tips=รับหรือตั้งค่าค่าจำนวนเต็ม chema-versio ที่ออฟเซ็ต 40 ในส่วนหัวของฐานข้อมูล
pragma-secure-delete-tips=คิวรีหรือเปลี่ยนการตั้งค่าลบปลอดภัย (secure-delete)
pragma-short-column-names-tips=คิวรีหรือเปลี่ยนแฟล็กชื่อคอลัมน์สั้น
pragma-soft-heap-limit-tips=จำกัดปริมาณหน่วยความจำ heap ที่ถูกครอบครองสำหรับการเชื่อมต่อฐานข้อมูลทั้งหมดในหนึ่งกระบวนการ
pragma-stats-tips=ส่งคืนข้อมูลเสริมเกี่ยวกับตารางและดัชนี
pragma-synchronous-tips=คิวรีหรือเปลี่ยนการตั้งค่าแฟล็ก "ซิงโครไนซ์ (synchronous)"
pragma-temp-store-tips=คิวรีหรือเปลี่ยนค่าตัวแปร全球 sqlite3_temp_directory แบ็กเอนด์อินเทอร์เฟซระบบปฏิบัติการจำนวนมากใช้ตัวแปรนี้เพื่อระบุว่าเก็บตารางและดัชนีชั่วคราวไว้ที่ไหน
pragma-threads-tips=จำนวนเธรดเสริมที่เริ่มต้นโดยคำสั่งที่เตรียมไว้ (prepared statement) เพื่อช่วยคิวรี
pragma-trusted-schema-tips=อนุญาตให้รันฟังก์ชัน SQL และตารางเสมือนที่ยังไม่ได้ตรวจสอบความปลอดภัยในสคีมาหรือไม่ ระบุว่าอนุญาตให้วิว ทริกเกอร์ หรือนิพจน์สคีมา (เช่น ข้อจำกัด CHECK ประโยค DEFAULT คอลัมน์ที่สร้าง ดัชนีนิพจน์ และ/หรือดัชนีบางส่วน) รันฟังก์ชัน SQL และตารางเสมือนที่ยังไม่ได้ตรวจสอบความปลอดภัยหรือไม่
pragma-user-version-tips=รับหรือตั้งค่าค่าจำนวนเต็ม user-version ที่ออฟเซ็ต 60 ในส่วนหัวของฐานข้อมูล
pragma-vdbe-addoptrace-tips=รหัสปฏิบัติการ VDBE แบบเต็มจะแสดงเมื่อถูกสร้างระหว่างการสร้างรหัส ข้อกำหนดคือ SQLite ถูกคอมไพล์ด้วยตัวเลือก SQLITE_DEBUG และ vdbe_debug เปิดอยู่
pragma-vdbe-debug-tips=เปิด debug VDBE ข้อกำหนดคือ SQLite ถูกคอมไพล์ด้วยตัวเลือก SQLITE_DEBUG
pragma-vdbe-listing-tips=แสดงรายการรหัสปฏิบัติการเครื่องเสมือนแบบเต็มบนเอาต์พุตมาตรฐาน ข้อกำหนดคือ SQLite ถูกคอมไพล์ด้วยตัวเลือก SQLITE_DEBUG และ vdbe_debug เปิดอยู่
pragma-vdbe-trace-tips=พิมพ์รหัสปฏิบัติการเครื่องเสมือนบนเอาต์พุตมาตรฐานเมื่อคำนวณ ข้อกำหนดคือ SQLite ถูกคอมไพล์ด้วยตัวเลือก SQLITE_DEBUG และ vdbe_debug เปิดอยู่
pragma-wal-autocheckpoint-tips=คิวรีหรือตั้งค่าช่วง间隔 write-ahead log/auto-checkpoint
pragma-wal-checkpoint-tips=ทำให้เนื้อหาใน write-ahead log ของฐานข้อมูล X บนการเชื่อมต่อฐานข้อมูล D ถูกถ่ายโอนไปยังไฟล์ฐานข้อมูล และรีเซ็ต write-ahead log
pragma-writable-schema-tips=สามารถเปลี่ยนตาราง sqlite_schema โดยใช้คำสั่ง UPDATE, INSERT และ DELETE ทั่วไป คำเตือน: การ lạmใช้คำสั่งคอมไพล์นี้ นำไปสู่ความเสียหายของไฟล์ฐานข้อมูล
pragma-save-confirm=คำสั่ง PRAGMA จะส่งผลต่อการดำเนินการของฐานข้อมูล คุณแน่ใจหรือไม่ที่จะรันคำสั่งด้านล่าง?
confirm-exec-text=ยืนยัน&รัน